xml/request/renewLoan.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openuserstatus">
   <soapenv:Header/>
   <soapenv:Body>
      <open:renewLoanRequest>
         <open:userId>?</open:userId>
         <!--Optional:-->
         <open:userPincode>?</open:userPincode>
         <open:agencyId>?</open:agencyId>
         <!--1 or more repetitions:-->
         <open:loanId>1</open:loanId>
         <open:loanId>2</open:loanId>
         <open:loanId>3</open:loanId>
      </open:renewLoanRequest>
   </soapenv:Body>
</soapenv:Envelope>
